package com.yxsd.kanshu.constant;

public enum ErrorCodeEnum {

	/* 全局 10000-11000 */
	/**
	 * 未知错误！
	 */
	ERROR_CODE_10000(10000, "未知错误！"),
	
	 
	/**
	 * 网络错误!
	 */
	ERROR_CODE_10001(10001, "网络错误!"),
	/**
	 * 参数非法!
	 */
	ERROR_CODE_10002(10002, "参数非法!"),
	/**
	 * 未登录用户
	 */
	ERROR_CODE_10003(10003, "未登录用户！"),
	/**
	 * 没有权限！
	 */
	ERROR_CODE_10004(10004, "没有权限！"),
	
	/**
	 * 系统没有配置相应参数
	 */
	ERROR_CODE_10005(10005, "系统没有配置相应参数！"),
	
	/**
	 * 参数内容不存在
	 */
	ERROR_CODE_10006(10006, "参数内容不存在！"),
	
	
	ERROR_CODE_10007(10007, "没有数据！"),
	/**
	 * 服务器内容已经被上次请求删除
	 */
	ERROR_CODE_10008(10008, "不存在,已删除！"),
	ERROR_CODE_10009(10009, "因官方限制，该书目前已下架！"),
	ERROR_CODE_10010(10010, "因官方限制，该书目前已下架"),
	ERROR_CODE_10011(10011, "未找到所请求的action"),
	ERROR_CODE_10012(10012, "上传图片失败"), 
	ERROR_CODE_10013(10013, "系统配置错误"),
	ERROR_CODE_10014(10014, "地址信息格式不正确"),
	ERROR_CODE_10015(10015, "电话格式不正确"),
	ERROR_CODE_10016(10016, "座机格式不正确"),
	
	ERROR_CODE_10100(10100, "操作频率过快"),
	
	/* 书城 11001-12000 */
	/**
	 * 根据栏目标识,没有取到数据
	 */
	ERROR_CODE_11002(11002,"没有取到栏目数据"),
	
	ERROR_CODE_11003(11003,"根据栏目编号查询缓存出错"),
	
	ERROR_CODE_11004(11004,"没有取到榜单数据"),
	
	ERROR_CODE_11005(11005,"火辣限免没有数据"),
	
	ERROR_CODE_11006(11006,"此条目已收藏"),
	
	ERROR_CODE_11007(11007,"不存在的公告类型标识"),
	ERROR_CODE_11008(11008,"公告类型下没内容"),
	
	ERROR_CODE_11009(11009,"该分类已经禁用"),
	ERROR_CODE_11010(11010, "调用纸书单品接口出错"),
	ERROR_CODE_11011(11011, "所请求商品不是纸书"),
	ERROR_CODE_11012(11012, "该用户没有默认地址"),
	
	ERROR_CODE_11100(11100,"专题没有关系栏目"),
	
	ERROR_CODE_11101(11101, "start或者end参数非法!"),
	
	/*
	 * 根据块标识，获取块   【11101-11200】
	 */
	ERROR_CODE_11102(11102,"块标识不存在"),

	/* 书架 12001-13000 */
	/**
	 * HTML下载方式不能下载多章!
	 */
	ERROR_CODE_12001(12001, "HTML下载方式不能下载多章!"),
	ERROR_CODE_12002(12002, "查询不到资源或章节!"),
	ERROR_CODE_12003(12003, "加解密出错！"),
	ERROR_CODE_12004(12004, "不支持该设备类型"),
	ERROR_CODE_12005(12005, "没有可以购买的章节了"),
	ERROR_CODE_12006(12006, "只能下载同一本书的章节"),
	ERROR_CODE_12007(12007, "购买失败"),
	ERROR_CODE_12008(12008, "当前应用版本不支持阅读该资源，请升级应用最新版本！"),

	/* 购物车 13001-14000 */
	ERROR_CODE_13001(13001, "错误的购物车ID!"),
	ERROR_CODE_13002(13002, "该用户购物车没有数据!"),
	ERROR_CODE_13003(13003, "添加单品到购物车失败!"),
	ERROR_CODE_13004(13004, "更新购物车失败!"),
	ERROR_CODE_13005(13005, "购物车已经存在相同的商品!"),
	ERROR_CODE_13006(13006, "对不起，您购买的商品已超出库存。"),

	ERROR_CODE_13007(13007, "商品缺货了，或者商品的价格小于等于0了,或者商品不存在，或者捆绑品缺货!"),
	ERROR_CODE_13008(13008, "商品不存在或者下架!"),
	ERROR_CODE_13009(13009, "购物车已有相同品，此品为限购品，您已达到最大限购数量!"),

    ERROR_CODE_13010(13010, "单品电子书购买数量只能为1!"),
    ERROR_CODE_13011(13011, "超量请通过购物车购买!"),
	ERROR_CODE_13012(13012, "您已购买此书!"),
	/* 买了又买 14001-14300*/
	ERROR_CODE_14001(14001, "mediaId参数非法!"),
	ERROR_CODE_14002(14002, "start参数非法!"),
	ERROR_CODE_14003(14003, "end参数非法!"),
	ERROR_CODE_14004(14004, "token参数非法!"),
	/* 看了又看 14301-14600*/
	ERROR_CODE_14301(14301, "mediaId参数非法!"),
	ERROR_CODE_14302(14302, "start参数非法!"),
	ERROR_CODE_14303(14303, "end参数非法!"),
	ERROR_CODE_14304(14304, "token参数非法!"),
	
	/* 猜你喜欢 14601-15000*/	
	ERROR_CODE_14601(14601, "token参数非法!"),
	ERROR_CODE_14602(14602, "start参数非法!"),
	ERROR_CODE_14603(14603, "end参数非法!"),
	
	
	/* 福袋【抽奖】 15001-15300*/
	ERROR_CODE_15001(15001, "没有抽奖次数!"),
	ERROR_CODE_15002(15002, "奖品超过日限制!"),
	ERROR_CODE_15003(15003, "奖品超过总限制!"),
	ERROR_CODE_15004(15004, "金币奖励接口发放失败!"),
	ERROR_CODE_15005(15005, "章节奖励接口发放失败!"),
	ERROR_CODE_15006(15006, "道具奖励接口发放失败!"),
	ERROR_CODE_15007(15007, "包月奖励接口发放失败!"),
	ERROR_CODE_15008(15008, "不存在此用户!"),
	ERROR_CODE_15009(15009, "有效奖品不足3个!"),
	ERROR_CODE_15010(15010, "调用发奖接口失败!"),
	ERROR_CODE_15011(15011, "获取福袋道具列表失败!"),
	ERROR_CODE_15200(15200, "分享系统错误!"),
	ERROR_CODE_15201(15201, "custId为空!"),
	
	/* 膜拜 15301-15500*/
	ERROR_CODE_15301(15301, "操作成功!"),
	ERROR_CODE_15302(15302, "这么任性？不能膜拜自己呦!"),
	ERROR_CODE_15303(15303, "超过该日限制的膜拜数，明日再来吧!"),
	ERROR_CODE_15304(15304, "膜拜给辅账号加钱，交易失败!"),
	ERROR_CODE_15400(15400, "膜拜系统错误!"),
	
	/* 分享 15501-15700*/
	ERROR_CODE_15501(15501, "操作成功!获得福袋，获得红包。"),//1-1
	ERROR_CODE_15502(15502, "操作成功!获得福袋，没获得红包。"),//1-0
	ERROR_CODE_15503(15503, "操作成功!没获得福袋，获得红包。"),//0-1
	ERROR_CODE_15504(15504, "操作成功!没获得福袋，没获得红包。"),//0-0
	ERROR_CODE_15505(15505, "福袋超日限，红包超日限!"),
	ERROR_CODE_15506(15506, "福袋超日限，红包没超日限!"),
	ERROR_CODE_15507(15507, "福袋没超日限，红包超日限!"),
	ERROR_CODE_15508(15508, "福袋没超日限，红包没超日限!"),
	ERROR_CODE_15511(15511, "红包没有了!"),
	ERROR_CODE_15512(15512, "用户的红包超过每日获取的限制!"),
	ERROR_CODE_15513(15513, "给辅账号加红包，交易失败!"),
	ERROR_CODE_15600(15600, "分享系统错误!"),
	
	/*赠书 */
	ERROR_CODE_15700(15700, "图书列表没有权限!"),
	ERROR_CODE_15701(15701, "图书列表已经有权限!"),
	ERROR_CODE_15702(15702, "赠书书包不存在!"),
	ERROR_CODE_15703(15703, "赠书书包已经失效!"),
	ERROR_CODE_15704(15704, "书架已有的书不能领取哦~"),
	ERROR_CODE_15705(15705, "选择的书中，含有没有全本权限的书籍"),
	ERROR_CODE_15706(15706, "调用权限接口出错，赠书失败。"),
	ERROR_CODE_15707(15707, "选择的书中，含有收到的书籍，不能再次赠送。"),
	
	/*打赏 */
	ERROR_CODE_15800(15800, "打赏消费错误，交易失败!"),
	ERROR_CODE_15801(15801, "现实比理想骨感，余额不足耶~"),
	ERROR_CODE_15802(15802, "打赏君出现错误了耶 ~ 稍候再试试好不好？"),
	/*打赏文章*/
	ERROR_CODE_15803(15803, "文章不存在！"),
	ERROR_CODE_15804(15804, "文章没有审批通过！"),
	ERROR_CODE_15805(15805, "没有找到该文章对应的频道！"),
	ERROR_CODE_15806(15806, "该文章不支持打赏！"),
	
	
	/*每日领福袋 */
	ERROR_CODE_15810(15810, "今天领过福袋了!"),
	/*撒金币 */
	ERROR_CODE_15820(15820, "人家不能重复被捡了啦~"),
	ERROR_CODE_15821(15821, "超出今日上限，捡不了人家了啦~"),
	
	/* 活动榜单相关 17001-18000*/
	ERROR_CODE_17801(17801, "获取数量不在【1--500】直接!"),
	ERROR_CODE_17802(17802, "不是单品的saleId!"),
	
	/*在线阅读相关*/
	ERROR_CODE_17860(17860, "不是试读章节，请登录!"),
	ERROR_CODE_17861(17861, "获取书籍的总页数，试读页出错!"),
	ERROR_CODE_17862(17862, "没有权限!"),
	ERROR_CODE_17863(17863, "获取书内索引跳转章节和页码信息出错!"),
	ERROR_CODE_17864(17864, "该书不支持网站阅读器阅读!"),
	ERROR_CODE_17865(17865, "获取内核返回当前风格跳转到另一风格的页码,实现页码同步出错!"),
	ERROR_CODE_17866(17866, "验证权限出错!"),
	ERROR_CODE_17867(17867, "获取章节相关信息出错!"),
	ERROR_CODE_17868(17868, "获取目录信息出错!"),
	ERROR_CODE_17869(17869, "超过获取价格信息限制！"),
	
	/* 充值购买  18001-19000*/
	ERROR_CODE_18001(18001, "用户交易失败!"),
	ERROR_CODE_18002(18002, "商品不可购买!"),
	ERROR_CODE_18003(18003, "获取最近一次支付方式失败!"),
	ERROR_CODE_18004(18004, "查询用户充值记录失败!"),
	ERROR_CODE_18005(18005, "查询用户余额失败!"),
	ERROR_CODE_18006(18006, "获取充值方式选择列表失败！"),
	ERROR_CODE_18007(18007, "获取购买包月页面数据失败！"),
	ERROR_CODE_18008(18008, "首次登陆送包月失败！"),
	ERROR_CODE_18009(18009, "首次分享送包月失败！"),
	ERROR_CODE_18010(18010, "ios支付校验失败！"),
	ERROR_CODE_18011(18011, "MD5参数签名校验失败！"),
	ERROR_CODE_18012(18012, "合并用户失败！"),
	ERROR_CODE_18013(18013, "校验订单未到款！"),
	
	/* 书评、弹幕 19001-20000*/
	ERROR_CODE_19001(19001, "添加评论失败!"),
	ERROR_CODE_19002(19002, "书评点赞失败!"),
	ERROR_CODE_19003(19003, "添加书评回复失败!"),
	ERROR_CODE_19004(19004, "该用户已经点过赞!"),
	ERROR_CODE_19101(19101, "添加弹幕失败!"),
	
	
	/** 发现20000-21000*/
	ERROR_CODE_20001(20001, "查询不到发现!"),
	ERROR_CODE_20002(20002, "添加发现评论出错!"),
	
	/** 百度云推送 21001-22000*/
	ERROR_CODE_21001(21001, "appId不能为空!"),
	ERROR_CODE_21002(21002, "extUserId不能为空!"),
	ERROR_CODE_21003(21003, "extChannelId不能为空!"),
	ERROR_CODE_21004(21004, "deviceSerialNo不能为空!"),
	ERROR_CODE_21006(21006, "clientVersionNo不能为空!"),
	ERROR_CODE_21007(21007, "deviceTypeNo不能为空!"),
	ERROR_CODE_21008(21008, "channelId不能为空!"),
	ERROR_CODE_21009(21009, "deviceTypeNo不合法!"),
	ERROR_CODE_21010(21010, "planId不能为空!"),
	ERROR_CODE_21011(21011, "planId不合法!"),
	ERROR_CODE_21012(21012, "appId不合法!"),
	ERROR_CODE_21013(21013, "mediaId不能为空!"),
	ERROR_CODE_21014(21014, "mediaId不合法!"),
	ERROR_CODE_21015(21015, "operationType不能为空!"),
	ERROR_CODE_21016(21016, "operationType不合法!"),
	ERROR_CODE_21017(21017, "notificationStatus不能为空!"),
	ERROR_CODE_21018(21018, "notificationStatus不合法!"),
	ERROR_CODE_21019(21019, "该appId下此设备号的记录不存在!"),
	ERROR_CODE_21020(21020, "调用百度api接口返回错误"),
	ERROR_CODE_21021(21021, "notification表中没有此用户此类型的绑定"),

	/** 精品阅读22001-23000 */
	ERROR_CODE_22001(22001, "该文章已被删除!"),
	ERROR_CODE_22002(22002, "不支持此次请求!"),
	ERROR_CODE_22003(22003, "文章已存在，不要重复收藏哦!"),
	ERROR_CODE_22004(22004, "取消收藏失败!"),
	ERROR_CODE_22005(22005, "文集名称不超过16个字符长度!"),
	ERROR_CODE_22006(22006, "文集名称只能输入中文字母数字等字符哦!"),
	ERROR_CODE_22007(22007, "您已使用该名称，换个名字吧!"),
	ERROR_CODE_22008(22008, "新建文集失败，请重试!"),
	ERROR_CODE_22009(22009, "该文集不存在!"),
	ERROR_CODE_22010(22010, "修改文集失败，请重试!"),
	ERROR_CODE_22011(22011, "删除文集或文章失败，请重试!"),
	ERROR_CODE_22012(22012, "对不起，您没有编辑该文集的权限!"),
	ERROR_CODE_22013(22013, "上传图片失败，请重试!"),
	ERROR_CODE_22014(22014, "获取图片失败，请重试!"),
	ERROR_CODE_22015(22015, "对不起，您没有删除该文集或文章的权限!"),
	ERROR_CODE_22016(22016, "对不起，您没有查看该文集的权限!"),
	ERROR_CODE_22017(22017, "该篇儿文章不存在!"),
	ERROR_CODE_22018(22018, "评论内容至少输入2个字符!"),
	ERROR_CODE_22019(22019, "评论内容不能多于600个字符!"),
	ERROR_CODE_22020(22020, "发表评论失败，请重试!"),
	ERROR_CODE_22021(22021, "亲，您因发布恶意内容，已被禁止发言!"),
	ERROR_CODE_22022(22022, "亲，请不要频繁发布评论，先休息会儿吧!"),
	ERROR_CODE_22023(22023, "该评论不存在!"),
	ERROR_CODE_22024(22024, "亲，您发表评论内容包含不合法关键字，请重新输入!"),
	ERROR_CODE_22025(22025, "请输入合法的电话号码或邮箱，做为联系方式!"),
	ERROR_CODE_22026(22026, "请选择图片上传!"),
	ERROR_CODE_22027(22027, "输入内容不超过500个字符哦!"),
	ERROR_CODE_22028(22028, "请选择待加入文集的文章!"),
	ERROR_CODE_22029(22029, "文章加入文集失败，请重试!"),
	ERROR_CODE_22030(22030, "文章已在该文集中，请不要重复添加!"),
	ERROR_CODE_22031(22031, "您已经赞过了"),
	
	/** 与精品阅读重复,修改 lvxiang**/
	/** 塞红包活动  23001-24000 */
	ERROR_CODE_23001(23001, "receiver参数非法!"),
	ERROR_CODE_23002(23002, "不能给自己塞红包!"),
	ERROR_CODE_23003(23003, "type参数非法!"),
	ERROR_CODE_23004(23004, "amount参数非法!"),
	ERROR_CODE_23005(23005, "塞金币消费失败!"),
	ERROR_CODE_23006(23006, "塞金币充值失败!"),
	ERROR_CODE_23007(23007, "创建个人消息失败!"),
	ERROR_CODE_23008(23008, "扣除福袋失败, 福袋数量不足!"),
	ERROR_CODE_23009(23009, "增加福袋失败!"),
	ERROR_CODE_23010(23010, "deviceType参数非法"),
	/** 塞红包活动子项目之微信授权  **/
	ERROR_CODE_23011(23011, "参数错误"),
	ERROR_CODE_23012(23012, "获得微信信息失败"),
	
	/** 银铃铛有效期 **/
	ERROR_CODE_24001(24001, "sequenceWay非法"),
	ERROR_CODE_24002(24002, "lastAttachItemId非法"),

	/**广点通 **/
	ERROR_CODE_25001(25001, "没有点击数据"),
	ERROR_CODE_25009(25009, "广点通广告点击记录出错"),


	/** 书吧、帖子错误码 25001-26000 **/
	
	ERROR_CODE_25002(25002, "最多只能输入50字哦！"),
	ERROR_CODE_25003(25003, "您的图片不太适合做背景图哦！"),
	ERROR_CODE_25004(25004, "提交成功，正在审核"),
	ERROR_CODE_25005(25005, "没有更多信息了~"),
	ERROR_CODE_25006(25006, "抱歉，该贴已被删除了"),
	ERROR_CODE_25007(25007, "抱歉，该贴已被删除了"),
	ERROR_CODE_25008(25008, "最多只能输入20字"),
	ERROR_CODE_25010(25010, "吧创建失败"),
	ERROR_CODE_25011(25011, "修改吧简介失败"),
	ERROR_CODE_25012(25012, "修改吧背景图片失败"),
	ERROR_CODE_25013(25013, "获取默认背景图片失败"),
	ERROR_CODE_25014(25014, "搜索书吧失败"),
	ERROR_CODE_25015(25015, "加入吧失败"),
	ERROR_CODE_25016(25016, "退出吧失败"),
	ERROR_CODE_25017(25017, "申请吧主失败"),
	ERROR_CODE_25018(25018, "获取吧成员列表失败"),
	ERROR_CODE_25019(25019, "获取吧详情失败"),
	ERROR_CODE_25020(25020, "发帖失败"),
	ERROR_CODE_25021(25021, "修改帖子失败"),
	ERROR_CODE_25022(25022, "获取我的吧失败"),
	ERROR_CODE_25023(25023, "删贴失败"),
	ERROR_CODE_25024(25024, "获取吧帖子列表失败"),
	ERROR_CODE_25025(25025, "获取单品页帖子列表失败"),
	ERROR_CODE_25026(25026, "获取帖子详情失败"),
	ERROR_CODE_25027(25027, "帖子被删除"),
	ERROR_CODE_25028(25028, "帖子被屏蔽"),
	ERROR_CODE_25029(25029, "获取书吧广场信息失败"),
	ERROR_CODE_25030(25030, "置顶/加精接口调用失败"),
	ERROR_CODE_25031(25031, "非法的图片格式"),
	ERROR_CODE_25032(25032, "非法的操作类型"),
	ERROR_CODE_25033(25033, "非法的卡片类型"),
	ERROR_CODE_25034(25034, "帖子标题不能超过20个字"),
	ERROR_CODE_25035(25035, "建吧等级不够"),
	ERROR_CODE_25036(25036, "吧名称含有敏感词"),
	ERROR_CODE_25037(25037, "吧简介含有敏感词"),
	ERROR_CODE_25038(25038, "帖子标题含有敏感词"),
	ERROR_CODE_25039(25039, "帖子内容含有敏感词"),
	ERROR_CODE_25040(25040, "添加标签失败"),
	ERROR_CODE_25041(25041, "亲，要到XX级后才可创建吧，快去升级加油！"),
	ERROR_CODE_25042(25042, "最多只能输入1000字"),
	ERROR_CODE_25043(25043, "该吧已经被转移到火星，无法被地球人看到"),
	ERROR_CODE_25044(25044, "请选择一张图片"),
	ERROR_CODE_25045(25045, "吧不存在"),
	ERROR_CODE_25046(25046, "您发贴速度太快啦，休息一会儿吧"),
	ERROR_CODE_25047(25047, "你之前发过相同的内容哦，发点别的高见吧"),
	ERROR_CODE_25048(25048, "非法的贴子类型"),
	ERROR_CODE_25049(25049, "分享到吧失败"),
	ERROR_CODE_25050(25050, "该吧还没通过审核哦，审核通过后就可以发帖了"),
	ERROR_CODE_25051(25051, "非法的书籍类型"),
	ERROR_CODE_25052(25052, "非法的文章类型"),
	ERROR_CODE_25053(25053, "是否匿名参数非法"),
	ERROR_CODE_25054(25054, "投票失败"),
	ERROR_CODE_25056(25056, "选项描述含有敏感词"),
	ERROR_CODE_25057(25057, "获取投票用户信息失败"),
	ERROR_CODE_25058(25058, "帖子标题不能超过50个字"),
	ERROR_CODE_25059(25059, "话题内容不能超过12个字"),
	/** 礼品卡，礼卷相关错误码 26001-27000 **/
	ERROR_CODE_26001(26001, "礼品卡激活失败,请重试!"),
	ERROR_CODE_26002(26002, "礼券激活失败,请重试!"),
	ERROR_CODE_26003(26003, "获取可用礼券失败!"),
	ERROR_CODE_26004(26004, "输入参数解析失败!"),
	ERROR_CODE_26005(26005, "无法享受该礼券!"),
	ERROR_CODE_26006(26006, "礼券已过期!"),
	ERROR_CODE_26007(26007, "扣除礼券失败!"),
	ERROR_CODE_26008(26008, "礼券号或密码为空!"),
	ERROR_CODE_26009(26009, "礼券使用失败!"),
	ERROR_CODE_26010(26010, "错误的礼券激活密码!"),
	ERROR_CODE_26011(26011, "优惠码转换到礼券失败!"),
	ERROR_CODE_26012(26012, "礼品卡使用失败!"),
	ERROR_CODE_26013(26013, "扣除余额失败!"),
	ERROR_CODE_26014(26014, "扣除礼品卡失败!"),
	ERROR_CODE_26015(26015, "调用非现金接口异常!"),
	ERROR_CODE_26016(26016, "礼券号或密码为空!"),
	ERROR_CODE_26017(26017, "错误的礼品卡激活密码!"),
	ERROR_CODE_26018(26018, "余额使用失败!"),
	ERROR_CODE_26019(26019, "无效的礼品卡号!"),
	ERROR_CODE_26020(26020, "无效的礼品卡密码!"),
	ERROR_CODE_26021(26021, "无此礼品卡信息!"),
	ERROR_CODE_26022(26022, "礼品卡密码错误!"),
	ERROR_CODE_26023(26023, "礼品卡已激活!"),
	ERROR_CODE_26024(26024, "礼品卡已过期!"),
	ERROR_CODE_26025(26025, "礼券号不能为空!"),
	ERROR_CODE_26026(26026, "无对应的礼券信息!"),
	ERROR_CODE_26027(26027, "礼券已过期!"),
	ERROR_CODE_26028(26028, "该礼券已被其他用户绑定!"),
	ERROR_CODE_26029(26029, "该礼券已被激活!"),
	ERROR_CODE_26030(26030, "礼券密码不正确!"),
	ERROR_CODE_26031(26031, "同批次礼券只能激活一个!"),
	ERROR_CODE_26032(26032, "该礼券无效!"),
	ERROR_CODE_26033(26033, "礼券号或密码不能为空"),
	
	ERROR_CODE_26100(26100, "获取发票内容失败!"),
	ERROR_CODE_26101(26101, "删除单位发票抬头失败!"),
	
	ERROR_CODE_26102(26102, "用户最近使用发票信息查找失败!"),
	ERROR_CODE_26103(26103, "发票内容无效!"),
	
	ERROR_CODE_26104(26104, "单位发票抬头索引无效!"),
	ERROR_CODE_26105(26105, "发票信息查找类型错误!"),
	ERROR_CODE_26106(26106, "发票抬头为空!"),
	ERROR_CODE_26107(26107, "发票内容不能为空!"),
	
	ERROR_CODE_26201(26201, "积分使用失败!"),
	ERROR_CODE_26202(26202, "扣除积分失败!"),
	ERROR_CODE_26203(26203, "积分不足!"),
	
	ERROR_CODE_26301(26301, "交易单更新失败!"),	
	ERROR_CODE_26302(26302, "订单提交失败!"),
	ERROR_CODE_26303(26303, "拆单失败!"),
	ERROR_CODE_26304(26304, "生成订单信息失败!"),
	
	ERROR_CODE_26401(26401, "收货地址有误!"),	
	ERROR_CODE_26402(26402, "订单类型限制收货地址!"),
	ERROR_CODE_26403(26403, "国内收货地址，手机号不在网段内!"),
	ERROR_CODE_26404(26404, "收货信息省市区不正确!"),	
	ERROR_CODE_26405(26405, "收货信息填写格式不正确!"),	
	ERROR_CODE_26406(26406, "身份证号不正确!"),	
	ERROR_CODE_20407(20407,	"地址信息有误，请重新修改"),
	ERROR_CODE_20408(20408,	"省市区地址信息有误，请重新修改"),
	ERROR_CODE_20409(20409,	"国家地址信息有误，请重新修改"),
	ERROR_CODE_20410(20410,	"地址信息有误，请重新修改"),
	ERROR_CODE_20411(20411,	"地址信息不完整，请补充完整"),
	ERROR_CODE_20412(20412,	"地址信息有误，请重新修改"),
	ERROR_CODE_20413(20413,	"地址信息格式有误，请重新修改"),
	ERROR_CODE_20414(20414,	"地址信息有误，请重新修改"),
	ERROR_CODE_20415(20415,	"收货地址不在商品配送范围内，请重新修改"),
	ERROR_CODE_20416(20416,	"国外地址信息有误，请重新修改"),
	ERROR_CODE_20417(20417,	"国外地址收货人姓名有误，请重新修改"),
	ERROR_CODE_20418(20418,	"国外地址收货人姓名不能为中文，请重新修改"),
	ERROR_CODE_20419(20419,	"填写国外详细地址信息不得少于5个字母"),
	ERROR_CODE_20420(20420,	"国内收货地址手机号不在网段内,请重新修改"),

	
	ERROR_CODE_26501(26501, "送货方式不合法!"),	
	ERROR_CODE_26502(26502, "没有选择送货方式!"),
	ERROR_CODE_26503(26503, "不支持送货方式!"),
	
	ERROR_CODE_26601(26601, "支付方式不合法!"),	
	ERROR_CODE_26602(26602, "需要选择支付方式!"),
	ERROR_CODE_26603(26603, "商家不支持支付方式!"),
	ERROR_CODE_26604(26604, "商家或所选城市不支持COD!"),	
	ERROR_CODE_26605(26605, "商家或所选城市不支持CODPOS!"),
	ERROR_CODE_26606(26606, "商品不支持支付方式!"),
	ERROR_CODE_26607(26607, "电子书不支持支付方式!"),
	
	ERROR_CODE_26701(26701, "无数据记录!"),	
	ERROR_CODE_26702(26702, "字符编码格式不正确!"),
	ERROR_CODE_26703(26703, "返回结果格式不支持!"),
	ERROR_CODE_26704(26704, "字符编码格式不正确&返回结果格式不支持!"),	
	ERROR_CODE_26705(26705, "订单号不能为空!"),	
	ERROR_CODE_26706(26706, "字符编码格式不正确&订单号不能为空!"),	
	ERROR_CODE_26707(26707, "返回结果格式不支持&订单号不能为空!"),	
	ERROR_CODE_26708(26708, "字符编码格式不正确&返回结果格式不支持&订单号不能为空!"),	
	
	/** 频道 相关**/
	ERROR_CODE_27001(27001, "bookListId非法"),
	ERROR_CODE_27002(27002, "书单不存在或已下架"),
	ERROR_CODE_27003(27003, "频道包月资费未找到"),
	ERROR_CODE_27004(27004, "该频道不支持包月"),
	ERROR_CODE_27005(27005, "非法分享,盗刷"),
    ERROR_CODE_27006(27006, "购买次数已到上限"),
    ERROR_CODE_27007(27007, "该频道已下架呦"),
	ERROR_CODE_27008(27008, "包月图书下载已超过10本，请还书后再试"),
    ERROR_CODE_27009(27009, "还书失败,请稍后重试"),
    ERROR_CODE_27010(27010, "已经到达下载次数10本上限,本次下载失败,请到android端的最新版本还书,才可以继续下载."),
    /** 虚拟支付相关  27100-27999**/
    
    ERROR_CODE_27108(27108, "虚拟币余额不足，请充值购买"),
    ERROR_CODE_27122(27122, "电子书不支持借阅"),
    ERROR_CODE_27180(27180, "获取促销价失败，请稍后重试!"),
    ERROR_CODE_27181(27181, "您已购买此电子书，请勿重复消费。"),
    ERROR_CODE_27200(27200, "电子书已下架"),
    ERROR_CODE_27201(27201, "电子书不存在"),
	ERROR_CODE_27301(27301, "电子书订单未找到"),
	ERROR_CODE_27302(27302, "电子书订单已支付"),	/**评论系统**/
	/**评论系统**/
	ERROR_CODE_40000(40000, "增加评论信息失败!"),
	ERROR_CODE_40001(40001, "用户Token失效!"),
	ERROR_CODE_40002(40002, "评论主体ID错误!"),
	ERROR_CODE_40003(40003, "评论内容含有敏感词!"),
	ERROR_CODE_40004(40004, "评论来源错误!"),
	ERROR_CODE_40005(40005, "设备类型错误!"),
	ERROR_CODE_40006(40006, "没有找到对应的评论信息!"),
	ERROR_CODE_40007(40007, "删除评论失败!"),
	ERROR_CODE_40008(40008, "举报内容不合法!"),
	ERROR_CODE_40009(40009, "增加举报评论信息失败!"),
	ERROR_CODE_40010(40010, "该用户已经点过赞"),
	ERROR_CODE_40011(40011, "该贴已经删除"),
	ERROR_CODE_40012(40012, "该用户已被禁言!"),
	ERROR_CODE_40013(40013, "该用户已经踩过"),
	ERROR_CODE_40014(40014, "您评论速度太快啦，休息一会儿吧"),
	ERROR_CODE_40015(40015, "你之前发过相同的内容哦，发点别的高见吧"),
	/** 个人中心 28001-28999 **/
	ERROR_CODE_28001(28001, "收藏类型参数不合法!"),
	ERROR_CODE_28002(28002, "平台类型参数不合法!"),
	ERROR_CODE_28003(28003, "收藏书籍不存在或已经下架!"),
	ERROR_CODE_28004(28004, "收藏文章不存在!"),
	ERROR_CODE_28005(28005, "收藏帖子不存在!"),
	ERROR_CODE_28006(28006, "取消收藏失败，请重试!"),
	ERROR_CODE_28007(28007, "不可重复收藏!"),
	ERROR_CODE_28008(28008, "该用户不存在!"),
	ERROR_CODE_28009(28009, "act参数不合法!"),
	ERROR_CODE_28010(28010, "用户已绑定Email,用户未绑定手机号"),
	ERROR_CODE_28011(28011, "用户未绑定Email,用户已绑定手机号"),
	ERROR_CODE_28012(28012, "手机号已经被其他用户绑定了,请更换新的手机号"),
	ERROR_CODE_28013(28013, "用户未绑定Emial,用户未绑定手机号"),
	ERROR_CODE_28014(28014, "用户已绑定Emial,用户已绑定手机号"),
	ERROR_CODE_28015(28015, "摇一摇”重磅升级啦，快更新软件去看看吧"),
	ERROR_CODE_28016(28016, "余额不足，无法摇奖。"),

	/** 借阅 29001-29999 **/
	ERROR_CODE_29001(29001, "已经存在该用户电子书借阅权限记录!"),
	ERROR_CODE_29002(29002, "还书失败!"),
	ERROR_CODE_29003(29003, "用户已还书!"),
	ERROR_CODE_29004(29004, "未找到指定电子书!"),
	
	/** 签到 30001-30999 **/
	ERROR_CODE_30001(30001, "今天已经签过了，明日再来吧!"),
	ERROR_CODE_30002(30002, "签到失败，请稍后再试!"),
	ERROR_CODE_30004(30004, "设备已签到,请您换个新的设备签到吧"),
	ERROR_CODE_30005(30005, "未查询到签到任务"),

    /** 主站银铃铛购买电子书 31001-31009 */
    ERROR_CODE_32001(32001,"请选择需要用铃铛支付的电子书!"),
    ERROR_CODE_30003(30003,"签到开关开启失败!"),
    
    /** 首页 31001-31200 **/
	ERROR_CODE_31001(31001, "status不合法!"),
	ERROR_CODE_31002(31002, "dataIdType不合法!"),
    ERROR_CODE_31003(31003,"dataId不合法!"),
    ERROR_CODE_31004(31004, "feature不合法!"),
	ERROR_CODE_31005(31005, "custId与deviceSerialNo至少填写一个!"),
    ERROR_CODE_31006(31006,"系统错误!"),
	ERROR_CODE_31007(31007, "活动不存在"),
	
	/** 读书计划  33001-33200 **/
	ERROR_CODE_33001(33001, "标题20个字以内"),
	ERROR_CODE_33002(33002, "简介50个字以内"),
	ERROR_CODE_33003(33003, "开始日期不能小于当前日期"),

	/** 积分商城 34001 34006**/
	ERROR_CODE_34001(34001, "积分不够啦,快去做任务去吧!"),
	ERROR_CODE_34002(34002, "兑换失败,该商品已下架"),
	ERROR_CODE_34003(34003, "兑换失败,该商品不存在"),
	ERROR_CODE_34004(34004, "兑换失败,扣减积分失败"),
	ERROR_CODE_34005(34005, "兑换失败,增加铃铛失败"),
	ERROR_CODE_34007(34007, "用户已经弹框"),
	
	/** 购物车相关35001-35199**/
	ERROR_CODE_35001(35001, "暂时缺货!" ),
	ERROR_CODE_35002(35002, "请先购买主品再选择赠品 !" ),
	ERROR_CODE_35003(35003, "很抱歉，您购买的商品暂时缺货，请选择其他商品。 " ),
	ERROR_CODE_35004(35004, "很抱歉～您购买的数量超过库存量。 " ),
	ERROR_CODE_35005(35005, "购物车中已经有相同商品。 " ),
	ERROR_CODE_35006(35006, "很抱歉～您购买的数量超过库存量，请选择其他商品 " ),
	ERROR_CODE_35007(35007, "购买量超过该商品的最大限购量" ),
	ERROR_CODE_35008(35008, "很抱歉，您所购商品中部分商品缺货或购买数量有限 " ),
	ERROR_CODE_35009(35009, "单品API数据获取错误或其他来源数据错误 " ),
	ERROR_CODE_35010(35010, "促销已结束 " ),
	ERROR_CODE_35011(35011, "暂时缺货 " ),
	ERROR_CODE_35012(35012, "赠品数量限一个 " ),
	ERROR_CODE_35013(35013, "很抱歉，一种商品仅能选择一种赠品。您可以进入购物车修改赠品 " ),
	ERROR_CODE_35014(35014, "请先购买主品再选择换购品 " ),
	ERROR_CODE_35015(35015, "很抱歉，由于换购商品重复等原因，商品未成功放入购物车 " ),
	ERROR_CODE_35016(35016, "很抱歉，您参加的送赠品促销赠品缺货，请重新选择其他赠品 " ),
	ERROR_CODE_35017(35017, "很抱歉，您购买的商品所选赠品库存不足,请修改数量 " ),
	ERROR_CODE_35018(35018, "很抱歉，一个订单中同一N元场只能参加一次 " ),
	ERROR_CODE_35019(35019, "购物车已有相同品，该商品限购" ),
	ERROR_CODE_35020(35020, "很抱歉，购买量超过该商品的最大限购量" ),
	ERROR_CODE_35021(35021, "至少%d件 " ),
	ERROR_CODE_35022(35022, "该套餐限购，您已达到限购数量 " ),
	ERROR_CODE_35023(35023, "很抱歉，商品由于暂时缺货或购买数量限制等原因未成功放入购物车 " ),
	ERROR_CODE_35024(35024, "购物车中已有相同套餐 " ),
	ERROR_CODE_35025(35025, "很抱歉，您购买的商品暂时缺货，请选择其他商品。 " ),
	ERROR_CODE_35026(35026, "您参加的满额赠促销赠品缺货，请重新选择其他赠品 " ),
	ERROR_CODE_35027(35027, "该促销不存在 " ),
	ERROR_CODE_35028(35028, "请选择赠品 " ),
	ERROR_CODE_35029(35029, "购物车已有相同品，此品为限购品，您已达到最大限购数量 " ),
	ERROR_CODE_35030(35030, "很抱歉，商品由于暂时缺货或购买数量限制等原因未成功放入购物车 " ),
	ERROR_CODE_35031(35031, "套餐中部分商品由于暂时缺货或库存不足等原因，导致套餐放入失败 " ),
	ERROR_CODE_35032(35032, "亲爱的顾客，您的订购满足团购条件啦！快去提交团购需求 享受更多的优惠、更周到的服务吧！ " ),
	ERROR_CODE_35033(35033, "商家限购" ),
	ERROR_CODE_35034(35034, "很抱歉，您购物车内的商品数量已超过最大限制，请分单购买" ),
	ERROR_CODE_35035(35035, "抱歉,您应付的价格超过1000元,请减少数量。" ),
	ERROR_CODE_35036(35036, "请选择足够的商品。" ),

	/**
	 * 活动礼包相关
	 */
	ERROR_CODE_27601(27601, "该手机号已领取过"),
	ERROR_CODE_27602(27602, "不存在此活动或者活动已失效"),
	ERROR_CODE_27603(27603, "所选奖品数量超限"),
	ERROR_CODE_27604(27604, "所选奖品不在奖池范围内"),
	ERROR_CODE_27605(27605, "不是有效的手机号"),
	ERROR_CODE_27616(27616, "用户未绑定手机号"),

	/**
	 * 大当收藏
	 */
	ERROR_CODE_28101(28101, "用户收藏的商品超过上限(2000)"),
	ERROR_CODE_28102(28102, "商品已收藏，更新收藏时间成功"),
	ERROR_CODE_28103(28103, "商品已收藏，更新收藏时间失败"),
	ERROR_CODE_28104(28104, "参数productIds数量超过上限(50)"),
	ERROR_CODE_28105(28105, "参数productId不是SKU品"),
	ERROR_CODE_28106(28106, "收藏失败，收藏的书已达上限500"),

	/**
	 * bi相关
	 */
	ERROR_CODE_50001(50001, "数据未准备好"),

	ERROR_CODE_99999(99999, "未定义错误");


	
	private Integer errorCode;
	private String errorMessage;

	private ErrorCodeEnum(Integer errorCode, String errorMessage) {
		this.errorCode = errorCode;
		this.errorMessage = errorMessage;
	}
	
	public static ErrorCodeEnum getByErrorCode(int errorCode){
		for(ErrorCodeEnum errorCodeEnum : ErrorCodeEnum.values()){
			if(errorCodeEnum.errorCode.intValue() == errorCode){
				return errorCodeEnum;
			}
		}
		return null;
	}

	public Integer getErrorCode() {
		return errorCode;
	}

	public void setErrorCode(Integer errorCode) {
		this.errorCode = errorCode;
	}

	public String getErrorMessage() {
		return errorMessage;
	}

	public void setErrorMessage(String errorMessage) {
		this.errorMessage = errorMessage;
	}
}
